#include <iostream>
#include <cmath>
using namespace std;
int main()
{
     int choice = 0; 
    cout << "Оберіть завдання : " <<endl; //Виводимо текстове повідомлення 
    cout << "1. Вирішення Завдання 6. Вивести окремо десятки та одиниці" << endl; //Оголошуємо варіанти вибору
    cout << "2. Вирішення Завдання 12. Вивести число, отримане при прочитанні вихідного числа справа наліво" << endl;
    cout << "3. Вирішення Завдання 20. Знайти кількість повних годин з початку доби" << endl;
    cin >> choice;
    switch (choice) {
        
    case 1: {
    int N; 
    cout << "Введіть двохзначне число: "; //Введення двохзначного числа
    cin>>N;
    int D = N / 10; //Знаходження десятків
    int O = N % 10; //Знаходження одиниць
    cout << "Десятки: " << D<< " "; //Виводимо результат
    cout << "Одиниці: " << O;
    return 0; }
    
    case 2: {
    int Num;
    cout<<"Введіть трьохзначне число: "; //Введення трьохзначного числа
    cin >> Num;
    int U = Num % 10; //Розділення числа на одиниці, десятки, сотні
    int T =(Num / 10) % 10;
    int H =Num / 100; 
    cout << "Число справа на ліво: "<<U*100+T*10+H<<endl; //Виведення числа справа на ліво
    return 0; }
    
    case 3: {
    int sec;
    cout<<"Введіть кількість секунд: "; //Введення кількості секунд
    cin>>sec;
    int hours = sec / 3600; //Знаходження кількості повних годин, викристовуючі кількість секунд в одній годині
    cout<<hours <<"- повних годин з початку доби"; //Виведення результату
    return 0; }
} 
}
