#include <iostream>
#include <cmath>
using namespace std;
int main()
{
     int choice = 0; 
    cout << "Оберіть завдання : " <<endl; //Виводимо текстове повідомлення 
    cout << "1. Вирішення Завдання 9. Знайти суму, різницю, добуток і частку квадратів заданих чисел" << endl; //Оголошуємо варіанти вибору
    cout << "2. Вирішення Завдання 22. Обчислити значення кута з радіан в градуси" << endl;
    cin >> choice;
    switch (choice) {
        
    case 1: {
    int a, b; // Оголошення змінних 
    int V1, V2, V3, V4; // Оголошення змінних 
    cout <<"Введіть значення a: "; //Запит на отримання даних
    cin >> a;
    cout<<"Введіть значення b: ";
    cin >> b;
    V1=(a*a) + (b*b); // Розрахунок
    V2=(a*a) - (b*b);
    V3=(a*a) * (b*b);
    V4=(a*a) / (b*b);
    cout<<"Сума квадратів: "<<V1<<";"; //Виводимо відповіді
    cout<<" "<<"Різниця квадратів: "<<V2<<";";
    cout<<" "<<"Добуток квадратів: "<<V3<<";";
    cout<<" "<<"Частка квадратів: "<<V4<<".";
    return 0; 
    }
    
    case 2: 
    double Pi = 3.14; //Створюємо змінні
    double K;
    cout << "Введіть значення кута в радіанах: "; //Запит на отримання даних
    cin >> K;
    if ( K >= 0 && K < 2 * Pi ) { //Встановлюємо умови за яких буде розраховання
    double G = K * (180/Pi); //Розрахунок
    cout<<"Значення кута в градусах: "<<G; //Виводимо результат
    return 0;}
    else { 
        cout <<"Невірне значення"; //За умови невірних даних виводимо текст
    }
    return 0; 
} 
}
